Revit 2027 API
TextAlignMask Enumeration
An enumerated type listing all the Text align mask.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TextAlignMask
Public Enumeration TextAlignMask
public enum class TextAlignMask
type TextAlignMask
Members
Member name | Value | Description
horzAlignMask | 448 | The mask of the Text object being aligned in the horizontal direction.
vertAlignMask | 3,584 | The mask of the Text object being aligned in the vertical direction.
See Also
Reference
Autodesk.Revit.DB Namespace